# Поработайте с переменными, создайте несколько, выведите на экран,
# запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.

num_1 = 10
num_2 = 20
num_3 = 30
print(num_1, num_2, num_3)

number_1 = int(input('Введите первое число: '))
number_2 = int(input('Введите второе число: '))
str_1 = input('Введите первое слово: ')
str_2 = input('Введите второе слово: ')
print(f'Первое число: {number_1}, Второе число: {number_2}, Первое слово: {str_1}, Второе слово: {str_2}')